Autodesk.Revit.DB.DimensionEqualityLabelFormatting.IsValidFormatOptions
Checks whether a FormatOptions object is valid for the LabelType.
Remarks:
Right now, only LabelType::LengthOfSegment or LabelType::TotalLength can have FormatOptions.
Returns:
True if the FormatOptions object is valid, false otherwise.
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.SetFormatOptions(Autodesk.Revit.DB.FormatOptions)
Sets format Options
formatOptions:
format options to be set
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.GetFormatOptions
Gets format Options
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.Suffix
suffix for the parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.Prefix
prefix for the parameter
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.LeadingSpaces
leading spaces before the parameter
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.LabelType
label type for the parameter
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting.#ctor(System.Int32,System.String,Autodesk.Revit.DB.LabelType,System.String,Autodesk.Revit.DB.FormatOptions)
Constructs a new copy of the input DimensionEqualityLabelFormatting object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2017 Subscription Update

Autodesk.Revit.DB.DimensionEqualityLabelFormatting
used for dimension equality formats defining
Remarks:
Dimension Equality label formatting class
Since:
2017 Subscription Update